import random

li = sorted(["כהן הראל", "גרינשפול אדיר", "נויבואר אופיר", "טוויק אורון", "דייב איילון", "פרידמן איתמר", "זמורה אלה",
             "פורמן אליאן", "פולק גיא", "מואס יהונתן", "גביש אופיר", "תמיר אייל", "ברעם הילה", "וינטרוב עילי",
             "טלמון נדב", "אפרתי יאהלי", "כהן יהלי", "דולקרט לאון", "זיני מאיה", "מנדיל הראל", "מן מעין", "סגל מתן",
             "שרוט סיוון", "וייס עדן", "קוגן עידו", "צ\'רני אפיק", "פנקר אגם", "קינמון אורי", "גורבמן שי",
             "תבור שירה"])
li_new = li.copy()
print(li)
result = f"גמד -> ענק! מספר משתתפים: {len(li)}\n"
for i in range(len(li)):
    index = -1
    while (li_new[index] == li[i]) or (index == -1):
        index = random.randrange(len(li_new))
    result += li[i] + " -> " + li_new[index] + "\n"
    li_new.remove(li_new[index])

print("\n")
print(result)
